content/posts/20200527014837-analisi_i.md
+++
title = "Analisi I"
author = ["Daniel Biasiotto"]
tags = ["university"]
draft = false
+++

## Grafici di Funzioni {#grafici-di-funzioni}


### Quoziente di Newton == m, pendenza, coefficiente angolare {#quoziente-di-newton-m-pendenza-coefficiente-angolare}


#### tasso medio di variazione di f nel passaggio da x_1 a x_2 {#tasso-medio-di-variazione-di-f-nel-passaggio-da-x-1-a-x-2}


#### pendenza di un grafico in un punto (x_1, f(x_1)) == derivata prima nel punto {#pendenza-di-un-grafico-in-un-punto--x-1-fx-1---derivata-prima-nel-punto}

<!--list-separator-->

-  limite da x_2 a x_1

<!--list-separator-->

-  pendenza non definita se pendenza da sx != pendenza da dx


### funzione localmente dritta in ( x_1 , f(x_1) ) {#funzione-localmente-dritta-in--x-1-fx-1}


#### se possibile definirne la pendenza in x_1 {#se-possibile-definirne-la-pendenza-in-x-1}


### retta tangente {#retta-tangente}


#### retta passante per un punto con pendenza = alla funzione cui e' tangente {#retta-passante-per-un-punto-con-pendenza-alla-funzione-cui-e-tangente}


### Teoremi {#teoremi}


#### Monotonia / Segno della pendenza {#monotonia-segno-della-pendenza}

<!--list-separator-->

-  f monotona crescente &lt;=&gt; pendenza di f su (a,b) e' positiva

<!--list-separator-->

-  f monotona decrescente &lt;=&gt; pendenza di f su (a,b) e' negativa


#### Convessita' / Monotonia della pendenza {#convessita-monotonia-della-pendenza}

<!--list-separator-->

-  f convessa \\/ &lt;=&gt; la pendenza cresce

<!--list-separator-->

-  f concava /\\ &lt;=&gt; la pendenza e' decrescente


## Integrali {#integrali}


### Integrali definiti {#integrali-definiti}


#### Area sottesa al grafico {#area-sottesa-al-grafico}


#### Ottenibile per approssimazione suddividendo in N intervalli con N --&gt; infinito {#ottenibile-per-approssimazione-suddividendo-in-n-intervalli-con-n-infinito}

<!--list-separator-->

-  sum(a,b) F(x)dx

<!--list-separator-->

-  intervalli dx = (b-a) / N

<!--list-separator-->

-  NB: abbiamo un integrale definito solo se il limite di N a infinito esiste finito e non dipende dagli z_i scelti (ad esempio z_i punto medio del intervallo corrispondente)


#### [sum(i=1,N) F(z_i)] \* (b-a)/N = S_N `~~~~` Somma di Riemann di F {#sum--i-1-n--f--z-i----b-a--n-s-n-somma-di-riemann-di-f}


#### calcolo della media di una funzione {#calcolo-della-media-di-una-funzione}

<!--list-separator-->

-  Somma di Riemann / (b-a)


### Calcolo Integrale {#calcolo-integrale}


### Integrali Impropri {#integrali-impropri}

1.  f non limitata - intervallo limitato
2.  f limitata     - intervallo non limitato
    Condizione `necessaria` alla convergenza (come nelle serie a termini positivi) limite a +inf = 0

integrale(1,+inf)(1/x^a)dx

-   a &lt;= 1 ==&gt; divergente
-   a &gt; 1  ==&gt; convergente a 1/(a-1)


#### convergenti {#convergenti}


#### divergenti {#divergenti}


### Teoremi {#teoremi}


#### T. di Torricelli-Barrow {#t-dot-di-torricelli-barrow}


#### T. fondamentale del calcolo integrale {#t-dot-fondamentale-del-calcolo-integrale}

<!--list-separator-->

-  sia G(x) := integrale(a,x)f(t)dt

<!--list-separator-->

-  Allora G derivabile e G'(x) = f(x) per qualsiasi x nel intervallo [a,b]

    <!--list-separator-->

    -  ovvero: G e' una primitiva di f su [a,b]


#### T. della Media integrale                                               `L20` {#t-dot-della-media-integrale-l20}

<!--list-separator-->

-  Media = Somma di Riemann / (b-a)


## Limiti {#limiti}


### Finito a Finito {#finito-a-finito}


#### lim(x-&gt;c)f(x) = l {#lim--x-c--f--x--l}


#### Qualsiasi epsilon &gt; 0 Esiste delta &gt; 0 (definito da epsilon) : x appartiene all'intorno di raggio delta di c tolto c ==&gt; f(x) appartiene all'intorno di raggio epsilon di l {#qualsiasi-epsilon-0-esiste-delta-0--definito-da-epsilon--x-appartiene-all-intorno-di-raggio-delta-di-c-tolto-c-f--x--appartiene-all-intorno-di-raggio-epsilon-di-l}


### Finito all'infinito {#finito-all-infinito}


### Infinito al finito {#infinito-al-finito}


### Infinito all'infinito {#infinito-all-infinito}


#### possibili asintoti obliqui {#possibili-asintoti-obliqui}


### Funzioni Continue {#funzioni-continue}


#### hanno limiti in x che coincidono con f(x) per tutto il dominio {#hanno-limiti-in-x-che-coincidono-con-f--x--per-tutto-il-dominio}

<!--list-separator-->

-  non ha salti ne buchi definiti in un secondo momento


#### Continuita' delle f elementari {#continuita-delle-f-elementari}


#### Continuita' somma, prodotto e inverso {#continuita-somma-prodotto-e-inverso}


#### Continuita' della funzione composta {#continuita-della-funzione-composta}


### Limiti Notevoli {#limiti-notevoli}


### Funzioni asintotiche {#funzioni-asintotiche}


#### lim(x-&gt;c)[f(x)/g(x)] = 1 {#lim--x-c--f--x--g--x--1}


#### f(x) ~ g(x)          per x -&gt; c {#f--x--g--x--per-x-c}


#### sin(x) ~ x           per x -&gt; 0 {#sin--x--x-per-x-0}


#### 1 - cos(x) ~ 1/2x    per x -&gt; 0 {#1-cos--x--1-2x-per-x-0}


#### lg(1+x) ~ x          per x -&gt; 0 {#lg--1-plus-x--x-per-x-0}


#### e^x ~ 1+x            per x -&gt; 0 {#e-x-1-plus-x-per-x-0}


### Teoremi {#teoremi}


#### Permanenza del Segno {#permanenza-del-segno}


#### T. del confronto {#t-dot-del-confronto}

<!--list-separator-->

-  limiti finiti

<!--list-separator-->

-  limiti infiniti


#### T. di Weierstrass {#t-dot-di-weierstrass}

<!--list-separator-->

-  Se f continua in [a,b]

    <!--list-separator-->

    -  esistono x_m minimo assoluto e x_M massimo assoluto appartententi a [a,b] :

    <!--list-separator-->

    -  f(x_m) &lt;= f(x) &lt;= f(x_M)


#### f Derivabile ==&gt; f Continua {#f-derivabile-f-continua}


## Differenziale {#differenziale}


### Teorema di Lagrange {#teorema-di-lagrange}


#### per una f {#per-una-f}

<!--list-separator-->

-  continua per [a,b]

<!--list-separator-->

-  derivabile in (a,b)


#### esiste un c contenuto in (a,b): {#esiste-un-c-contenuto-in--a-b}

la sua derivata coincide con la pendenza della retta passante per a e b estremi di f, quindi la pendenza media


### Approssimazione locale di funzioni {#approssimazione-locale-di-funzioni}


#### Usando il polinomio di Taylor di ordine n {#usando-il-polinomio-di-taylor-di-ordine-n}


#### O polinomio di Maclaurin (Taylor centrato in 0) {#o-polinomio-di-maclaurin--taylor-centrato-in-0}


## Successioni {#successioni}

una funzione che associa ad ogni intero positivo un numero in R

-   convergente =&gt; limitata
-   divergente a +inf =&gt; inferiormente limitata
-   divergente a -inf =&gt; superiormente

a e b sono dette `asintotiche` se il loro rapporto a +inf tende a 1 &lt;=&gt; a ~ b


### Successione Geometrica `L14` {#successione-geometrica-l14}

-   a_n = q \* a_n-1 == q^n \* a_0

dove q e' detta ragione


### Confronti di crescita `L15` {#confronti-di-crescita-l15}


#### f = o(g) per x -&gt; +inf {#f-o--g--per-x-plus-inf}

g cresce piu' velocemente e il rapporto f/g tende a 0 a +inf


#### Teorema di de l'Hopital {#teorema-di-de-l-hopital}

il limite del rapporto delle derivate e' uguale al limite del rapporto delle funzioni


#### Simboli di Landau {#simboli-di-landau}

-   f = O(g) per x -&gt; +inf se il limite |f/g| = L
    -   f = o(g) per x -&gt; +inf se il limite f/g = 0
    -   f ~ g    per x -&gt; +inf se il limite f/g = 1


### Ricorrenze Lineari {#ricorrenze-lineari}

-   x_n+1 = ax+n + b
-   x_0

a=1

-   b=0
    successione costante
-   b!=0
    divergente a +-infinito

a!=1

-   x\* = b/(1-a) dove x\* e' punto fisso di f: f(x\*) = x\*

-1 &lt; a &lt; 1

-   converge

    |   |        |
    |---|--------|
    | a | &gt; 1 |
-   diverge


## Risoluzione approssimata di equazioni {#risoluzione-approssimata-di-equazioni}


### Teorema delle'esistenza degli zeri `L17` {#teorema-delle-esistenza-degli-zeri-l17}

-   sia f: [a,b] --&gt; R continua
-   f(a)f(b) &lt; 0

Allora

-   Esiste un c contenuto in (a,b): f(c) = 0 (non e' detto sia unico)


### Metodi di bisezione `L17` {#metodi-di-bisezione-l17}


### Metodo di Newton `L18` {#metodo-di-newton-l18}

f due volte derivabile

-   f(a)f(b) &lt; 0
-   f' e f'' hanno segno costante su [a,b]
-   f(a)f''(a) &gt; 0 OPPURE f(b)f''(b) &gt; 0

Allora

-   esiste uno e uno solo alpha incluso in (a,b): f(alpha) = 0


## Serie {#serie}

Somme di infiniti termini `~` sommatorie di successioni                     `L19`

-   convergente se limite a +inf di S_N = S
-   divergente se limite a +inf di S_N = inf
-   irregolare/oscillante/indeterminata se non esiste limite a +inf di S_N

Se a_n &gt;= 0 allora S_N non e' irregolare

-   sum(n=0,+inf)q^n
    -   0 &lt;= q &lt; 1 ==&gt; `converge` a 1/(1-q)
    -   q &gt;= 1     ==&gt; `diverge` a +inf


### Serie Geometrica {#serie-geometrica}

sum(n=0,+inf)q^n

-   -1 &lt; q &lt; 1
    `converge` 1/(1-q)
-   q &lt;= -1
    `irregolare`
-   q &gt;= 1
    `diverge` positivamente


### Serie Armonica {#serie-armonica}

1/n (diverge a +inf) o generalizzata: 1/(n^a)

-   0 &lt; a &lt;= 1 ==&gt; serie divergente
-   a &gt; 1     ==&gt; convergente


### Serie Esponenziale                                                         `L24` {#serie-esponenziale-l24}


## Dimostrazioni {#dimostrazioni}


### [T. del Confronto](https://www.youmath.it/lezioni/analisi-matematica/limiti-continuita-e-asintoti/1562-teorema-dei-dei-carabinieri.html)                                                           `L9` {#t-dot-del-confronto-l9}


### Continuita' delle f derivabili {#continuita-delle-f-derivabili}


### Caratteriz. delle f a derivata nulla su un intervallo                      `L11` {#caratteriz-dot-delle-f-a-derivata-nulla-su-un-intervallo-l11}


### Carat. delle primitive delle stessa f                                      `L11` {#carat-dot-delle-primitive-delle-stessa-f-l11}


### Test di monotonia                                                          `L11` {#test-di-monotonia-l11}


### Concavita' e convessita' di f e monotonia della sua derivata prima         `L12` {#concavita-e-convessita-di-f-e-monotonia-della-sua-derivata-prima-l12}


### Calcolo del polinomio di McLaurin di ordine n di {#calcolo-del-polinomio-di-mclaurin-di-ordine-n-di}


#### e^x {#e-x}


#### log(1+x) {#log--1-plus-x}


#### sin(x) {#sin--x}


#### cos(x) {#cos--x}


#### (1+x)^a {#1-plus-x--a}


### T fondamentale del Calcolo Integrale                                       `L21` {#t-fondamentale-del-calcolo-integrale-l21}


### [T di Torricelli-Barrow](https://library.weschool.com/lezione/calcolo-integrale-teorema-fondamentale-torricelli-barrow-dimostrazione-analisi-14707.html)                                                     `L21` {#t-di-torricelli-barrow-l21}


### T. esistenza degli zeri                                                    `L17` {#t-dot-esistenza-degli-zeri-l17}


### T di convergenza del metodo di Newton                                      `L18` {#t-di-convergenza-del-metodo-di-newton-l18}


### Condizione necessaria di convergenza di una serie                          `L19` {#condizione-necessaria-di-convergenza-di-una-serie-l19}

che il suo n-esimo termine sia infinitesimo


### Convergenza e divergenza della serie geometrica {#convergenza-e-divergenza-della-serie-geometrica}


### Criterio del confronto integrale per la convergenza di una serie           `L24` {#criterio-del-confronto-integrale-per-la-convergenza-di-una-serie-l24}


### Convergenza/divergenza delle serie armoniche generalizzate                 `L20` {#convergenza-divergenza-delle-serie-armoniche-generalizzate-l20}
